/*
snes.c - Super NES support for uCON64

Copyright (c) 1999 - 2002 NoisyB <noisyb@gmx.net>
Copyright (c) 2001 - 2004 dbjh
Copyright (c) 2002 - 2003 John Weidman
Copyright (c) 2004        JohnDie


This program is free software; you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation; either version 2 of the License, or
(at your option) any later version.

This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with this program; if not, write to the Free Software
Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.
*/
#ifdef  HAVE_CONFIG_H
#include "config.h"
#endif
#include <ctype.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#ifdef  HAVE_UNISTD_H
#include <unistd.h>
#endif
#include <sys/stat.h>
#include "misc/bswap.h"
#include "misc/misc.h"
#include "misc/string.h"
#include "misc/chksum.h"
#include "misc/file.h"
#ifdef  USE_ZLIB
#include "misc/archive.h"
#endif
#include "misc/getopt2.h"                       // st_getopt2_t
#include "ucon64.h"
#include "ucon64_misc.h"
#include "snes.h"
#include "backup/mgd.h"
#include "backup/gd.h"
#include "backup/swc.h"
#include "backup/fig.h"
#include "backup/ufo.h"



      OPTION_LONG_S "stp just strips the first 512 bytes",
      NULL
    },
    {
      "dbuh", 0, 0, UCON64_DBUH,
      NULL, "display (relevant part of) backup unit header",
      &ucon64_wf[WF_OBJ_SNES_DEFAULT]
    },
    {
      "dint", 0, 0, UCON64_DINT,
      NULL, "deinterleave ROM (regardless whether the ROM is interleaved)",
      &ucon64_wf[WF_OBJ_ALL_INIT_PROBE_NO_SPLIT]
    },
    {
      "ctrl", 1, 0, UCON64_CTRL,
      "TYPE", "specify type of controller in port 1 for emu when converting\n"
      "TYPE=0 gamepad\n"
      "TYPE=1 mouse\n"
      "TYPE=2 mouse / gamepad\n"
      "TYPE=6 multitap",
      &ucon64_wf[WF_OBJ_ALL_SWITCH]
    },
    {
      "ctrl2", 1, 0, UCON64_CTRL2,
      "TYPE", "specify type of controller in port 2 for emu when converting\n"
      "TYPE=0 gamepad\n"
      "TYPE=1 mouse\n"
      "TYPE=2 mouse / gamepad\n"
      "TYPE=3 super scope\n"
      "TYPE=4 super scope / gamepad\n"
      "TYPE=5 Konami's justifier\n"
      "TYPE=6 multitap\n"
      "TYPE=7 mouse / super scope / gamepad",
      &ucon64_wf[WF_OBJ_SNES_SWITCH]
    },
    {
      "col", 1, 0, UCON64_COL,
      "0xCOLOR", "convert 0xRRGGBB (HTML) <-> 0xXXXX (SNES)"
      /*"this routine was used to find green colors in games and\n"
      "to replace them with red colors (blood mode)"*/,
      &ucon64_wf[WF_OBJ_SNES_NO_ROM]
    },
    {
      "j", 0, 0, UCON64_J,
      NULL, "join split ROM",
      &ucon64_wf[WF_OBJ_ALL_INIT_PROBE]
    },
    {
      "s", 0, 0, UCON64_S,
      NULL, "split ROM; default part size is 8 Mb",
      &ucon64_wf[WF_OBJ_ALL_DEFAULT_NO_SPLIT]
    },
    {
      "ssize", 1, 0, UCON64_SSIZE,
      "SIZE", "specify split part size in Mbit (not for Game Doctor SF3)",
      &ucon64_wf[WF_OBJ_ALL_SWITCH]
    },
#if 0
    {
      "p", 0, 0, UCON64_P,
      NULL, "pad ROM to full Mb",
      &ucon64_wf[WF_OBJ_ALL_DEFAULT]
    },
#endif
    {
      "k", 0, 0, UCON64_K,
      NULL, "remove protection (crack)",
      &ucon64_wf[WF_OBJ_SNES_DEFAULT]
    },
    {
      "f", 0, 0, UCON64_F,
      NULL, "remove NTSC/PAL protection",
      &ucon64_wf[WF_OBJ_ALL_DEFAULT]
    },
    {
      "l", 0, 0, UCON64_L,
      NULL, "remove SlowROM checks",
      &ucon64_wf[WF_OBJ_SNES_DEFAULT]
    },
    {
      "chk", 0, 0, UCON64_CHK,
      NULL, "fix ROM checksum",
      &ucon64_wf[WF_OBJ_ALL_DEFAULT]
    },
    {
      "multi", 1, 0, UCON64_MULTI,
      "SIZE", "make multi-game file for use with Super Flash flash card,\n"
      "truncated to SIZE Mbit; file with loader must be specified\n"
      "first, then all the ROMs, multi-game file to create last",
      &ucon64_wf[WF_OBJ_ALL_INIT_PROBE_STOP]
    },
    {
      "dmirr", 0, 0, UCON64_DMIRR,
      NULL, "\"de-mirror\" ROM (strip mirrored block from end of ROM)",
      &ucon64_wf[WF_OBJ_SNES_DEFAULT]
    },
    {
      "dnsrt", 0, 0, UCON64_DNSRT,
      NULL, "\"de-NSRT\" ROM (restore name and checksum from NSRT header)",
      &ucon64_wf[WF_OBJ_SNES_DEFAULT]
    },
    {NULL, 0, 0, 0, NULL, NULL, NULL}
  };

typedef struct st_snes_header
{
  unsigned char maker_high;                     // 0
  unsigned char maker_low;                      // 1
  unsigned char game_id_prefix;                 // 2
  unsigned char game_id_low;                    // 3
  unsigned char game_id_high;                   // 4
  unsigned char game_id_country;                // 5
  // 'E' = USA, 'F' = France, 'G' = Germany, 'J' = Japan, 'P' = Europe, 'S' = Spain
  unsigned char pad1[7];                        // 6
  unsigned char sfx_sram_size;                  // 13
  unsigned char pad2[2];                        // 14
  unsigned char name[SNES_NAME_LEN];            // 16
  unsigned char map_type;                       // 37, a.k.a. ROM makeup
  unsigned char rom_type;                       // 38
#define bs_month rom_type                       // release date, month
  unsigned char rom_size;                       // 39
#define bs_day rom_size                         // release date, day
  unsigned char sram_size;                      // 40
#define bs_map_type sram_size
  unsigned char country;                        // 41
#define bs_type country
  unsigned char maker;                          // 42
  unsigned char version;                        // 43
  /*
    If we combine the following 4 bytes in 2 short int variables,
    inverse_checksum and checksum, they will have an incorrect value on big
    endian machines.
  */
  unsigned char inverse_checksum_low;           // 44
  unsigned char inverse_checksum_high;          // 45
  unsigned char checksum_low;                   // 46
  unsigned char checksum_high;                  // 47
} st_snes_header_t;

static st_snes_header_t snes_header;
static int snes_split, snes_sramsize, snes_sfx_sramsize, snes_header_base,
           snes_hirom, snes_hirom_ok, nsrt_header, bs_dump, st_dump;
static snes_file_t type;

static unsigned char gd3_hirom_8mb_map[GD3_HEADER_MAPSIZE] =
  {
    0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20,
    0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20, 0x20,
    0x22, 0x22, 0x22, 0x22, 0x22, 0x22, 0x22, 0x22
  };
static unsigned char gd3_hirom_16mb_map[GD3_HEADER_MAPSIZE] =
  {
    0x20, 0x21, 0x20, 0x21, 0x20, 0x21, 0x20, 0x21,
    0x20, 0x21, 0x20, 0x21, 0x20, 0x21, 0x20, 0x21,
    0x22, 0x23, 0x22, 0x23, 0x22, 0x23, 0x22, 0x23
  };
static unsigned char gd3_hirom_24mb_map[GD3_HEADER_MAPSIZE] =
  {
    0x20, 0x21, 0x22, 0x00, 0x20, 0x21, 0x22, 0x00,
    0x20, 0x21, 0x22, 0x00, 0x20, 0x21, 0x22, 0x00,
    0x24, 0x25, 0x23, 0x00, 0x24, 0x25, 0x23, 0x00
  };
